In [ ]:
pip install numpy

Requirement already satisfied: numpy in c:\users\cw\appdata\local\programs\python\python311\lib\site-packages (2.4.1)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.2.1 -> 26.0
[notice] To update, run: python.exe -m pip install --upgrade pip

In [127]:
pip install pandas

Requirement already satisfied: pandas in c:\users\cw\appdata\local\programs\python\python311\lib\site-packages (3.0.0)
Requirement already satisfied: numpy>=1.26.0 in c:\users\cw\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.4.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\cw\appdata\roaming\python\python311\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: tzdata in c:\users\cw\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2025.3)
Requirement already satisfied: six>=1.5 in c:\users\cw\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.2.1 -> 26.0
[notice] To update, run: python.exe -m pip install --upgrade pip

In [128]:
import numpy as np
import pandas as pd

In [129]:
df=pd.read_csv('C:\\Users\\cw\\Desktop\\cells\\Social_Network_Ads - Social_Network_Ads.csv')

In [130]:
df.head(5)

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [131]:
df['Gender'].value_counts()

Gender
Female    204
Male      196
Name: count, dtype: int64

In [132]:
x=df.drop(columns=['Purchased'])
y=df['Purchased']

In [133]:
from sklearn.preprocessing import LabelEncoder

In [134]:
lb= LabelEncoder()

In [135]:
x_train=lb.fit_transform(x['Gender'])

In [136]:
from sklearn.model_selection import train_test_split

In [137]:
x_train,x_test,y_train,y_test=train_test_split(x_train,y,test_size=0.2,random_state=42)

In [ ]:
 np.round(x_train.describe(),2)

In [ ]:
from sklearn.preprocessing import StandardScaler

In [ ]:
sc=StandardScaler()

In [ ]:
x_train_sc=sc.fit_transform(x_train)

In [ ]:
x_train_new=pd.DataFrame(x_train_sc,columns=x_train.columns)

In [ ]:
np.round(x_train.describe(),2)

           0
count  320.0
mean     0.5
std      0.5
min      0.0
25%      0.0
50%      0.5
75%      1.0
max      1.0

In [ ]:
from sklearn.preprocessing import OrdinalEncoder
oe=OrdinalEncoder()

In [ ]:
df_ar=oe.fit_transform(df)

In [ ]:
df_new=pd.DataFrame(df_ar,columns=df.columns)

In [ ]:
df_new

     User ID  Gender   Age  EstimatedSalary  Purchased
0       97.0     1.0   1.0              4.0        0.0
1      392.0     1.0  17.0              5.0        0.0
2      155.0     0.0   8.0             26.0        0.0
3       64.0     0.0   9.0             39.0        0.0
4      382.0     1.0   1.0             57.0        0.0
..       ...     ...   ...              ...        ...
395    196.0     0.0  28.0             24.0        1.0
396    220.0     1.0  33.0              8.0        1.0
397    130.0     0.0  32.0              5.0        1.0
398    305.0     1.0  18.0             17.0        0.0
399     45.0     0.0  31.0             20.0        1.0

[400 rows x 5 columns]

In [ ]:
from sklearn.preprocessing import OneHotEncoder

In [ ]:
ohe=OneHotEncoder(drop='first',sparse_output=False,dtype=np.int32)

In [ ]:
df.isnull().sum()

User ID            0
Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

In [ ]:
df=df.drop(columns=['Age'])

In [ ]:
ohe=fit_transform(df[['Gender']])

In [141]:
pd.get_dummies(df,columns=['Gender'],drop_first=True)

      User ID  Age  EstimatedSalary  Purchased  Gender_Male
0    15624510   19            19000          0         True
1    15810944   35            20000          0         True
2    15668575   26            43000          0        False
3    15603246   27            57000          0        False
4    15804002   19            76000          0         True
..        ...  ...              ...        ...          ...
395  15691863   46            41000          1        False
396  15706071   51            23000          1         True
397  15654296   50            20000          1        False
398  15755018   36            33000          0         True
399  15594041   49            36000          1        False

[400 rows x 5 columns]

In [ ]:
 a=a.astype(int)

In [ ]:
a